[{"pattern":"^[ >]*Jestes tak zmeczon(y|a), ze nie mozesz dalej podazac w tym kierunku\\.$","type":"1"},{"pattern":"stoi ci na drodze.","type":"0"},{"pattern":"Bierzesz rozbieg i probujesz przeskoczyc wyrwe, jednak zle wymierzasz odleglosc","type":"2"},{"pattern":"krypty zablokowane jest przez kamienna plyte.","type":"0"},{"pattern":"Jesli chcesz, by brama zostala otwarta, musisz do niej zapukac lub w nia uderzyc.","type":"2"},{"pattern":"Przejscie blokuje obalony pien","type":"2"},{"pattern":"Brama jest zamknieta noca.","type":"2"},{"pattern":"Chcesz sforsowac zamknieta brame?","type":"2"},{"pattern":"Chcesz wpasc do rozpadliny? Taka decyzje musisz potwierdzic.","type":"2"},{"pattern":"Chwytasz za bluszcz probujac wspiac sie z jego pomoca na szczyt urwiska. Udaje ci sie nawet pokonac z pol metra, nim rosliny rwa sie, zmuszajac cie do upadku.","type":"2"},{"pattern":"Cofasz sie pare krokow, bierzesz gleboki oddech, rozpedzasz sie, lecz w ostatniej chwili zatrzymujesz sie tuz przed ogniem","type":"2"},{"pattern":"^[ >]*(Czarnowlosa wysoka gnomka|Raila) zagradza ci droge\\.$","type":"1"},{"pattern":"Droge zastepuje ci barczysty straznik mowiac: Prosze okazac kwit magazynowy lub wskazac towar do przechowania.","type":"2"},{"pattern":"Forsowanie zamknietych drzwi nie jest najlepszym pomyslem.","type":"2"},{"pattern":"Geste krzaki i porzucone narzedzia zupelnie blokuja dalsza podroz w tym kierunku. Niestety, musisz zawrocic.","type":"2"},{"pattern":"^[ >]*Idziesz na polnocny-zachod, lecz zawracasz zrezygnowan(y|a), gdyz przejscie zostalo zasypane\\.$","type":"1"},{"pattern":"^[ >]*Idziesz na poludniowy-wschod, lecz zawracasz zrezygnowan(y|a), gdyz przejscie zostalo zasypane\\.$","type":"1"},{"pattern":"Jest zbyt ciemno, zeby moc znalezc stad jakies wyjscie.","type":"2"},{"pattern":"Juz po chwili dostrzegasz jednak, ze przejscie zatrzymuje sie na poteznej skalnej scianie.","type":"2"},{"pattern":"Karczmarz zagradza ci wejscie do kuchni.","type":"2"},{"pattern":"Ktos inny juz to zaczal robic. Otwor nie jest dosc szeroki by udalo sie to dwom osobom na raz.","type":"0"},{"pattern":"Masz zbyt wielkie obawy by tam wejsc.","type":"2"},{"pattern":"hardo do ciebie: A ty gdzie? Tam maja wstep tylko mahakamscy kowale.","type":"0"},{"pattern":"Moze najpierw wyjdz z wody","type":"2"},{"pattern":"Musisz stanac w kolejce i poczekac na audiencje.","type":"2"},{"pattern":"^[ >]*(Nie mozesz sie tam udac, gdyz |)([Op]*pierzona skrzydlata bestia|[Ss]krzydlaty lwiopodobny potwor|[a-z]+ niebezpieczny gryf) swoim cielskiem zagradza ci droge( ucieczki|) na .*","type":"1"},{"pattern":"Ogromny stwor blokuje dojscie do bramy.","type":"2"},{"pattern":"^Ruszasz po granitowej posadzce na [a-z-]+, jednak powstrzymuje cie buchajacy z peknietego chodnika strumien goracej pary\\.$","type":"1"},{"pattern":"Musisz najpierw przywiazac do kolowrotu jakas line lub sznur.","type":"2"},{"pattern":"Nie udaje ci sie przecisnac przez geste krzaki.","type":"2"},{"pattern":"Ruszasz w dalsza droge ale nagle stajesz w pol kroku. Twoja znajomosc wykrywania pulapek podpowiada ci, ze w tym miejscu moze kryc sie jakies niebezpieczenstwo.","type":"2"},{"pattern":"Wrota sa zatopione w lodzie, nie da sie ich otworzyc.","type":"2"},{"pattern":"Nie dasz rady otworzyc zelaznego wlazu, musisz sprobowac go uniesc.","type":"2"},{"pattern":"Na dachu brakuje juz miejsca dla ciebie i czy chcesz czy nie, zepchniety zostajesz do pomieszczenia ponizej.","type":"2"},{"pattern":"Podchodzisz pod drzwi na polnocy, ktore nagle otwieraja sie z hukiem i wylatuje przez nie pijany mezczyznaomal na ciebie nie wpadajac. Zaraz potem drzwi zatrzaskuja sie.","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz znajdujesz sie w wodzie.","type":"2"},{"pattern":"Najpierw trzeba otworzyc klape.","type":"2"},{"pattern":"Podchodzisz pod drzwi na polnocy,","type":"2"},{"pattern":"Probujesz znalezc dogodne przejscie przez strumien, lecz woda jest w tym miejscu zbyt gleboka.","type":"2"},{"pattern":"Ochotnik zagradza ci droge!","type":"2"},{"pattern":"Patrzysz na spieniona, gorska rzeke i zastanawiasz sie nad tym czy sobie poradzisz... Tym razem decydujesz sie zrezygnowac z przeprawy.","type":"2"},{"pattern":"Po chwili wahania decydujesz sie nie schodzic.","type":"2"},{"pattern":"Po przejsciu paru krokow zauwazasz, ze majaczy przed toba potezna skalna sciana.","type":"2"},{"pattern":"Pociagasz za klamke, ale drzwi sa zamkniete.","type":"2"},{"pattern":"Pozostalosci po snieznej lawinie uniemozliwiaja dalsza wedrowke w wybranym kierunku.","type":"2"},{"pattern":"^[ >]*Przeciez nie bedziesz [ws]chodzic po drabinie majac obie rece zajete trzymaniem broni!$","type":"1"},{"pattern":"Przygladasz sie uwaznie miejscu, na ktorego chcesz sie wspiac i oceniajac trudnosc wspinaczki stwierdzasz ze najpierw musisz troche odpoczac.","type":"2"},{"pattern":"Ruszasz przed siebie, zaglebiajac sie w leszczyne, lecz od samego poczatku odnosisz wrazenie, ze sciezka cie zwodzi, nie chcac przepuscic przez gestwine\\. Po dluzszym czasie przedzierania sie przez trzesawisko, wracasz do punktu wyjscia.","type":"2"},{"pattern":"Schodzisz na dol po drabince, lecz w polowie drogi pomieszczenie okazuje sie byc zalane ciemna woda","type":"2"},{"pattern":"Smok zagradza ci przejscie do pieczary.","type":"2"},{"pattern":"Szarpiesz energicznie za klamke, lecz drzwi stawiaja opor.","type":"2"},{"pattern":"Troll zastawia Ci wejscie.","type":"2"},{"pattern":"Uhhh, nie odwazysz sie przeskoczyc tak szerokiej przepasci!","type":"2"},{"pattern":"Uuups... droga sie skonczyla... Najlepiej bedzie jak zawrocisz!","type":"2"},{"pattern":"^[ >]*(Valent|Otyly wasaty mezczyzna) blokuje ci droge, odganiajac trzymanym w reku tasakiem\\.$","type":"1"},{"pattern":"^[ >]*Wasaty potezny krasnolud .* hardo do ciebie\\. Dokad leziesz\\. Wara stad komu innemu glowe zawracac\\.$","type":"1"},{"pattern":"Wejscie tylko dla glow klanow.","type":"2"},{"pattern":"Wydaje ci sie, ze kowal jest bardzo znany z tego, ze nigdy nie ma go w kuzni. W tej wiosce konia nie podkujesz i musisz poszukac gdzie indziej.","type":"2"},{"pattern":"^[ >]*(Zapracowana mloda krasnoludka|Frina) mowi twardo: Gdzie sie pcha\\?!$","type":"1"},{"pattern":"zastawia przejscie do poludniowej nawy","type":"0"},{"pattern":"Zboj zagradza ci przejscie na poludnie.","type":"2"},{"pattern":"Zimne spojrzenia obecnych tu osob powstrzymuja cie skutecznie.","type":"2"},{"pattern":"Zbyt szybko probujesz ruszyc dalej, momentalnie tracac rownowage na waskim przejsciu","type":"2"},{"pattern":"Zbyt wiele rzeczy cie przytlacza, by udalo ci sie z tym wszystkim wgramolic na gore.","type":"2"},{"pattern":"Trwa ladowanie danych postaci","type":"1"},{"pattern":"Opierasz stopy o wyczuwane w kominie wyrwy, jednak nie mogac przytrzymac sie wolna reka brzegu komina, cofasz wsuniete juz wen nogi.","type":"2"},{"pattern":"Drabina jest zbyt nisko, by ja wykorzystac do zejscia.","type":"2"},{"pattern":"Ktos inny juz to zaczal robic. Otwor nie jest dosc szeroki by udalo sie to dwom osobom na raz.","type":"2"},{"pattern":"Wejscie do kurhanu jest zamkniete kamienna plyta.","type":"2"},{"pattern":"do ciebie: Nikt z bronia nie wejdzie na teren Uniwersytetu. Prosze zostawic ja na stojaku.","type":"0"},{"pattern":"Wspinasz sie po pionowej scianie skalnej, jednak w polowie drogi twoja noga zeslizguje sie, a ty, nie mogac zlapac sie niczego mogacego powstrzymac twe obsuniecie, spadasz spowrotem na dol.","type":"2"},{"pattern":"Wrota stajni sa zamkniete na noc.","type":"2"},{"pattern":"Wszystkie stragany sa juz uprzatniete.","type":"2"},{"pattern":"^[ >]*Droge na .* blokuje nieprzebyty masyw skalny\\.$","type":"1"},{"pattern":"staje na drodze blokujac przejscie.","type":"0"},{"pattern":"^[ >]*.* zjawa.* swym niematerialnym cialem blokuje ci dalsza droge w glab swiatyni\\.$","type":"1"},{"pattern":"do ciebie: Obcych nie wpuszczamy na teren zamku uzbrojonych. Zeby wejsc musisz oddac cala swoja bron.","type":"0"},{"pattern":"do ciebie: Nikt z zakryta twarza nie wejdzie","type":"0"},{"pattern":"Drabina w tej chwili jest zajmowana przez kogos innego, musisz chwile poczekac, az sie zwolni.","type":"2"},{"pattern":"Straznik zastawia ci droge, tlumaczac, ze o tej porze nie ma odwiedzin.","type":"2"},{"pattern":"By plynac musisz miec wolne rece.","type":"2"},{"pattern":"do ciebie: Nikt z bronia nie wejdzie na teren palacu. Prosze zostawic ja na stojaku.","type":"0"},{"pattern":"Przeciez sarkofag jest zamkniety!","type":"2"},{"pattern":"Musisz najpierw zejsc z podestu","type":"2"},{"pattern":"Woda wydaje ci sie tak zimna, ze jednak decydujesz sie nie przeskakiwac przez sciane wody. Moze lepiej najpierw oswoic sie z chlodna woda...","type":"2"},{"pattern":"Podejscie pod mury silnie bronionego zamku nie jest najlepszym pomyslem.","type":"2"},{"pattern":"Ruszasz razno na [a-z-]+, lecz po kilku krokach grzezniesz w krzakach.","type":"1"},{"pattern":"Wstep tylko dla czlonkow Zgromadzenia.","type":"2"},{"pattern":"^[ >]*(\\w+\\s+){1,4}zagradza ci droge\\.$","type":"1"},{"pattern":"Drzwi sa zamkniete, musisz sie wrocic.","type":"2"},{"pattern":"Mimo wlozenia wszystkich sil w wioslowanie nie jestes w stanie pokonac niezwykle silnego pradu wody.","type":"2"},{"pattern":"Przeciez lezysz na lozku! Moze lepiej najpierw z niego wstac?","type":"2"},{"pattern":"Rezygnujesz z przeplyniecia","type":"2"},{"pattern":"mowi do ciebie: Nikt z zakryta twarza nie stanie przed obliczem ksiecia.","type":"0"},{"pattern":"W chwili gdy ruszasz w strone zachodniej czesci pomieszczenia, zylki na zbrojach stojacych w niszach krasnoludow rozpalaja sie na zielono. Postaci jakby niepomne tego, ze zostaly wykonane z kamienia, wystepuja ze swoich wnek, blokujac ci przejscie dalej.","type":"2"},{"pattern":"^(?!Rzucasz).* staje ci na drodze\\.$","type":"1"},{"pattern":"mowi do ciebie: Nikt z bronia nie stanie przed obliczem ksiecia. Prosze zostawic ja na stojaku.","type":"0"},{"pattern":"staje na drodze .+ blokujac ","type":"1"},{"pattern":"Podejscie pod mury silnie bronionego garnizonu nie jest najlepszym pomyslem...","type":"3"},{"pattern":"Podchodzisz pod drzwi na polnocy, zza ktorych rozlega sie czyjs ponury glos: 'Zmiataj stad, nim ktos ci sprezentuje sztylet pod zebrami!'","type":"2"},{"pattern":"Tylko i wylacznie mieszkancy osady moga tam wejsc.","type":"2"},{"pattern":"Probujesz przecisnac sie przez otwor na dach, ale ze wzgledu na brak miejsca, zmuszony jestes wrocic na dol.","type":"2"},{"pattern":"Straznik ignoruje twoja prosbe.","type":"2"},{"pattern":"Nie mozesz tam przejsc, gdy stoi tu obsada statku.","type":"2"},{"pattern":"do ciebie: Nikt z bronia nie wejdzie na teren gornej twierdzy. Prosze zostawic ja na stojaku.","type":"0"},{"pattern":"Przejscie w tym kierunku jest zablokowane przez","type":"2"},{"pattern":"Przejscie w tym kierunku jest dla ciebie zbyt waskie, nie potrafisz przecisnac sie przez przeswit.","type":"2"},{"pattern":"Aby kierowac lodzia, musisz usiasc przy wioslach.","type":"2"},{"pattern":"Mimo wlozenia wszystkich sil w wioslowanie nie jestes w stanie pokonac niezwykle silnego pradu wody.","type":"2"},{"pattern":"Przestajesz wioslowac.","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz wielki pustynny robak lapie cie jednym ze szczekoczulkow i przyciaga do siebie.","type":"2"},{"pattern":"Lawa nie pozwala isc dalej w tym kierunku. Mozesz jednak sprobowac ja przeskoczyc.","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz walczysz wlasnie z ryba. Jesli chcesz, mozesz","type":"2"},{"pattern":"Nie masz sil plynac.","type":"2"},{"pattern":"Plot jest za wysoki dla ciebie.","type":"2"},{"pattern":"Nie masz tam wstepu","type":"2"},{"pattern":"Nie masz dalej wstepu","type":"2"},{"pattern":"Nie masz jak sie stad wydostac, gdyz klapa w suficie jest zamknieta","type":"2"},{"pattern":"Nie masz na to sily","type":"2"},{"pattern":"Nie masz juz sil walczyc z zywiolem i dajesz sie poniesc pradowi na","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz lezysz","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz siedzisz","type":"2"},{"pattern":"^Nie mozesz sie tam udac, gdyz .* blokuj(e|a) ci droge na.*","type":"1"},{"pattern":"Nie mozesz wyjsc z domu poniewaz stoisz na krzesle","type":"2"},{"pattern":"Nie mozesz wyjsc z domu poniewaz stoisz na szafie","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz kapiesz sie w jeziorku","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz pod wplywem spojrzenia zoltych slepi zlowrogiego ptakopodobnego mezczyzny","type":"2"},{"pattern":"Nie mozesz zejsc gdyz klapa jest zamknieta","type":"2"},{"pattern":"^Nie mozesz sie tam udac, gdyz .* zagradza","type":"1"},{"pattern":"Nie mozesz tak po prostu wymknac sie z walki","type":"2"},{"pattern":"Najpierw wejdz do kabiny i sie rozbierz!","type":"2"},{"pattern":"Najpierw wejdz do kabiny i sie ubierz!","type":"2"},{"pattern":"Niestety drzwi zdaja sie byc zaryglowane od wewnatrz","type":"2"},{"pattern":"Niestety, mieszkancy najwyrazniej zamykaja sie na noc. Chyba lepiej bedzie sprobowac za dnia","type":"2"},{"pattern":"Niestety, nie zmiescisz sie, gdyz ktos juz sie tam znajduje","type":"2"},{"pattern":"Niestety, wyglada na to, ze wiecej osob niz jedna sie tam nie zmiesci","type":"2"},{"pattern":"Niestety, brama jest zamknieta","type":"2"},{"pattern":"Niestety, sniezne zaspy zasypaly przelecz, uniemozliwiajac podroz traktem na","type":"2"},{"pattern":"^Probujesz otworzyc (.*|)(brame|wrota|drzwi|krate|furtke|drzwiczki|drzwiczki w bramie|wrota z brazu), ale nie udaje ci sie to\\.$","type":"1"},{"pattern":"Probujesz otworzyc drzwi, lecz oprocz alarmujacego dzwieku dzwonkow nie osiagasz zadnych efektow.","type":"2"},{"pattern":"^Probujesz przekroczyc brame, ale .* zastepuje ci droge\\.$","type":"1"},{"pattern":"Probujesz przepchnac stojace pod sciana beczki. Niestety sa dla ciebie za ciezkie i musisz dac za wygrana.","type":"2"},{"pattern":"Probujesz rozpaczliwie wspiac sie na gore, ale zeslizgujesz sie po mokrych kamieniach.","type":"2"},{"pattern":"Probujesz sie wcisnac do otworu, jednakze ktos najwyrazniej jest juz w srodku, a jest tam zbyt wasko by zmiescily sie tam dwie osoby na raz.","type":"2"},{"pattern":"Probujesz wspiac sie po pniu, ale robisz to zbyt slamazarnie i zjezdzasz z powrotem w dol.","type":"2"},{"pattern":"Probujesz wdrapac sie na omszaly pien zagradzajacy droge, lecz na sliskiej korze osuwa ci sie noga i spadasz z powrotem na sciezke.","type":"2"},{"pattern":"Probujesz otworzyc brame, ale jest zamknieta!","type":"2"},{"pattern":"Probujesz otworzyc brame, ale jest zamknieta od wewnatrz.","type":"2"},{"pattern":"Probujesz wejsc w zakryte pajeczynami przejscie, lecz duzy szarawy golem odpycha cie brutalnie.","type":"2"},{"pattern":"Probujesz przecisnac sie przez otwor na dach, ale ze wzgledu na brak miejsca,","type":"2"},{"pattern":"Probujesz isc w glab korytarza, lecz zwalisty szarawy golem zastepuje ci droge.","type":"2"},{"pattern":"Probujesz przecisnac sie przez otwor na dach, ale ze wzgledu na brak miejsca, zmuszony jestes wrocic na dol.","type":"2"},{"pattern":"Podchodzisz pod drzwi na polnocy, ktore nagle otwieraja sie z hukiem i wylatuje przez nie pijany mezczyzna omal na ciebie nie wpadajac. Zaraz potem drzwi zatrzaskuje sie.","type":"2"},{"pattern":"Podchodzisz pod drzwi na poludniu, jednak okazuja sie one zamkniete na klucz.","type":"2"},{"pattern":"Podchodzisz do drzwi i szarpiesz za klamke, jednak sa one zamkniete. Wiszaca obok kartka informuje:","type":"2"},{"pattern":"^Nie jestes pewn(y|a) swojej umiejetnosci plywania w tej brudnej rzece\\.\\.\\.$","type":"1"},{"pattern":"Nie jestes w stanie wymknac sie stad niezauwazenie.","type":"2"},{"pattern":"^[ >]*Nie jestes zbyt pewn(y|a) swojej umiejetnosci latania\\.\\.\\.$","type":"1"},{"pattern":"^[ >]*Nie mozesz sie tam udac, gdyz [a-z ]+ troll zagradza ci droge na [a-z]+\\.$","type":"1"},{"pattern":"^[ >]*Nie widzisz zadnego mostku ani nawet kladki, a woda w tym miejscu rzeki jest dosc gleboka\\. Zawracasz zrezygnowan(y|a)\\.$","type":"1"},{"pattern":"^[ >]*Nie dasz rady otworzyc .*, musisz sprobowac ja uniesc\\.$","type":"1"},{"pattern":"^[ >]*Nie dasz rady otworzyc .*  kraty, musisz sprobowac ja uniesc\\.$","type":"1"},{"pattern":"Nie jestes dowodca zadnej druzyny.","type":"2"},{"pattern":"Nie wolno ci sie tam udac.","type":"2"},{"pattern":"Nie mozesz sie tam udac, gdyz musisz najpierw zejsc z wozu","type":"2"},{"pattern":"Nie ma takiej komendy. Wpisz","type":"2"},{"pattern":"^[ >]*(Njalla|Czerwononosa rudowlosa krasnoludka) .* do ciebie: Jeno Smoki moga tam wchodzic, winc si nie pchaj, kaj cie nie zapraszaja\\.$","type":"1"},{"pattern":"^[ >]*(Njalla|Czerwononosa rudowlosa krasnoludka) nie podnoszac glowy mamrocze do ciebie niewyraznie: Nawet o tym nie mysl Bratenku, nawet o tym nie mysl\\.$","type":"1"},{"pattern":"^[ >]*(Njalla|Czerwononosa rudowlosa krasnoludka) wstaje, bierze zamach i rzuca kuflem w twoja strone, po czym siada za lawa, dajac ci do zrozumienia, ze nie lubi sie powtarzac\\.$","type":"1"},{"pattern":"^[ >]*(Njalla|Czerwononosa rudowlosa krasnoludka) zagradza droge wyciagajac nogi tak, ze blokuja przejscie na zaplecze, po czym zasypia w najlepsze.*","type":"1"},{"pattern":"^[ >]*(Njalla|Czerwononosa rudowlosa krasnoludka) .* do ciebie: Gdzie z tym pyskiem sie pchasz, no gdzie\\?$","type":"1"}]